{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "efficientdet_p", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "stem_conv", "class_name": "Conv2D", "config": {"name": "stem_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "stem_bn", "class_name": "BatchNormalization", "config": {"name": "stem_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["stem_conv", 0, 0, {}]]]}, {"name": "stem_activation", "class_name": "Activation", "config": {"name": "stem_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["stem_bn", 0, 0, {}]]]}, {"name": "block1a_dwconv", "class_name": "DepthwiseConv2D", "config": {"name": "block1a_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["stem_activation", 0, 0, {}]]]}, {"name": "block1a_bn", "class_name": "BatchNormalization", "config": {"name": "block1a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block1a_dwconv", 0, 0, {}]]]}, {"name": "block1a_activation", "class_name": "Activation", "config": {"name": "block1a_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block1a_bn", 0, 0, {}]]]}, {"name": "block1a_se_squeeze", "class_name": "GlobalAveragePooling2D", "config": {"name": "block1a_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block1a_activation", 0, 0, {}]]]}, {"name": "block1a_se_reshape", "class_name": "Reshape", "config": {"name": "block1a_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 32]}, "inbound_nodes": [[["block1a_se_squeeze", 0, 0, {}]]]}, {"name": "block1a_se_reduce", "class_name": "Conv2D", "config": {"name": "block1a_se_reduce", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1a_se_reshape", 0, 0, {}]]]}, {"name": "block1a_se_expand", "class_name": "Conv2D", "config": {"name": "block1a_se_expand", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1a_se_reduce", 0, 0, {}]]]}, {"name": "block1a_se_excite", "class_name": "Multiply", "config": {"name": "block1a_se_excite", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block1a_activation", 0, 0, {}], ["block1a_se_expand", 0, 0, {}]]]}, {"name": "block1a_project_conv", "class_name": "Conv2D", "config": {"name": "block1a_project_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1a_se_excite", 0, 0, {}]]]}, {"name": "block1a_project_bn", "class_name": "BatchNormalization", "config": {"name": "block1a_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block1a_project_conv", 0, 0, {}]]]}, {"name": "block2a_expand_conv", "class_name": "Conv2D", "config": {"name": "block2a_expand_conv", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1a_project_bn", 0, 0, {}]]]}, {"name": "block2a_expand_bn", "class_name": "BatchNormalization", "config": {"name": "block2a_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block2a_expand_conv", 0, 0, {}]]]}, {"name": "block2a_expand_activation", "class_name": "Activation", "config": {"name": "block2a_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block2a_expand_bn", 0, 0, {}]]]}, {"name": "block2a_dwconv", "class_name": "DepthwiseConv2D", "config": {"name": "block2a_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["block2a_expand_activation", 0, 0, {}]]]}, {"name": "block2a_bn", "class_name": "BatchNormalization", "config": {"name": "block2a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block2a_dwconv", 0, 0, {}]]]}, {"name": "block2a_activation", "class_name": "Activation", "config": {"name": "block2a_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block2a_bn", 0, 0, {}]]]}, {"name": "block2a_se_squeeze", "class_name": "GlobalAveragePooling2D", "config": {"name": "block2a_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block2a_activation", 0, 0, {}]]]}, {"name": "block2a_se_reshape", "class_name": "Reshape", "config": {"name": "block2a_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 96]}, "inbound_nodes": [[["block2a_se_squeeze", 0, 0, {}]]]}, {"name": "block2a_se_reduce", "class_name": "Conv2D", "config": {"name": "block2a_se_reduce", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2a_se_reshape", 0, 0, {}]]]}, {"name": "block2a_se_expand", "class_name": "Conv2D", "config": {"name": "block2a_se_expand", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2a_se_reduce", 0, 0, {}]]]}, {"name": "block2a_se_excite", "class_name": "Multiply", "config": {"name": "block2a_se_excite", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block2a_activation", 0, 0, {}], ["block2a_se_expand", 0, 0, {}]]]}, {"name": "block2a_project_conv", "class_name": "Conv2D", "config": {"name": "block2a_project_conv", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2a_se_excite", 0, 0, {}]]]}, {"name": "block2a_project_bn", "class_name": "BatchNormalization", "config": {"name": "block2a_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block2a_project_conv", 0, 0, {}]]]}, {"name": "block2b_expand_conv", "class_name": "Conv2D", "config": {"name": "block2b_expand_conv", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2a_project_bn", 0, 0, {}]]]}, {"name": "block2b_expand_bn", "class_name": "BatchNormalization", "config": {"name": "block2b_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block2b_expand_conv", 0, 0, {}]]]}, {"name": "block2b_expand_activation", "class_name": "Activation", "config": {"name": "block2b_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block2b_expand_bn", 0, 0, {}]]]}, {"name": "block2b_dwconv", "class_name": "DepthwiseConv2D", "config": {"name": "block2b_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["block2b_expand_activation", 0, 0, {}]]]}, {"name": "block2b_bn", "class_name": "BatchNormalization", "config": {"name": "block2b_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block2b_dwconv", 0, 0, {}]]]}, {"name": "block2b_activation", "class_name": "Activation", "config": {"name": "block2b_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block2b_bn", 0, 0, {}]]]}, {"name": "block2b_se_squeeze", "class_name": "GlobalAveragePooling2D", "config": {"name": "block2b_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block2b_activation", 0, 0, {}]]]}, {"name": "block2b_se_reshape", "class_name": "Reshape", "config": {"name": "block2b_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 144]}, "inbound_nodes": [[["block2b_se_squeeze", 0, 0, {}]]]}, {"name": "block2b_se_reduce", "class_name": "Conv2D", "config": {"name": "block2b_se_reduce", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2b_se_reshape", 0, 0, {}]]]}, {"name": "block2b_se_expand", "class_name": "Conv2D", "config": {"name": "block2b_se_expand", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2b_se_reduce", 0, 0, {}]]]}, {"name": "block2b_se_excite", "class_name": "Multiply", "config": {"name": "block2b_se_excite", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block2b_activation", 0, 0, {}], ["block2b_se_expand", 0, 0, {}]]]}, {"name": "block2b_project_conv", "class_name": "Conv2D", "config": {"name": "block2b_project_conv", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2b_se_excite", 0, 0, {}]]]}, {"name": "block2b_project_bn", "class_name": "BatchNormalization", "config": {"name": "block2b_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block2b_project_conv", 0, 0, {}]]]}, {"name": "block2b_drop", "class_name": "FixedDropout", "config": {"name": "block2b_drop", "trainable": true, "dtype": "float32", "rate": 0.025, "noise_shape": [null, 1, 1, 1], "seed": null}, "inbound_nodes": [[["block2b_project_bn", 0, 0, {}]]]}, {"name": "block2b_add", "class_name": "Add", "config": {"name": "block2b_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block2b_drop", 0, 0, {}], ["block2a_project_bn", 0, 0, {}]]]}, {"name": "block3a_expand_conv", "class_name": "Conv2D", "config": {"name": "block3a_expand_conv", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2b_add", 0, 0, {}]]]}, {"name": "block3a_expand_bn", "class_name": "BatchNormalization", "config": {"name": "block3a_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block3a_expand_conv", 0, 0, {}]]]}, {"name": "block3a_expand_activation", "class_name": "Activation", "config": {"name": "block3a_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block3a_expand_bn", 0, 0, {}]]]}, {"name": "block3a_dwconv", "class_name": "DepthwiseConv2D", "config": {"name": "block3a_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["block3a_expand_activation", 0, 0, {}]]]}, {"name": "block3a_bn", "class_name": "BatchNormalization", "config": {"name": "block3a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block3a_dwconv", 0, 0, {}]]]}, {"name": "block3a_activation", "class_name": "Activation", "config": {"name": "block3a_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block3a_bn", 0, 0, {}]]]}, {"name": "block3a_se_squeeze", "class_name": "GlobalAveragePooling2D", "config": {"name": "block3a_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block3a_activation", 0, 0, {}]]]}, {"name": "block3a_se_reshape", "class_name": "Reshape", "config": {"name": "block3a_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 144]}, "inbound_nodes": [[["block3a_se_squeeze", 0, 0, {}]]]}, {"name": "block3a_se_reduce", "class_name": "Conv2D", "config": {"name": "block3a_se_reduce", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3a_se_reshape", 0, 0, {}]]]}, {"name": "block3a_se_expand", "class_name": "Conv2D", "config": {"name": "block3a_se_expand", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3a_se_reduce", 0, 0, {}]]]}, {"name": "block3a_se_excite", "class_name": "Multiply", "config": {"name": "block3a_se_excite", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block3a_activation", 0, 0, {}], ["block3a_se_expand", 0, 0, {}]]]}, {"name": "block3a_project_conv", "class_name": "Conv2D", "config": {"name": "block3a_project_conv", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3a_se_excite", 0, 0, {}]]]}, {"name": "block3a_project_bn", "class_name": "BatchNormalization", "config": {"name": "block3a_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block3a_project_conv", 0, 0, {}]]]}, {"name": "block3b_expand_conv", "class_name": "Conv2D", "config": {"name": "block3b_expand_conv", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3a_project_bn", 0, 0, {}]]]}, {"name": "block3b_expand_bn", "class_name": "BatchNormalization", "config": {"name": "block3b_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block3b_expand_conv", 0, 0, {}]]]}, {"name": "block3b_expand_activation", "class_name": "Activation", "config": {"name": "block3b_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block3b_expand_bn", 0, 0, {}]]]}, {"name": "block3b_dwconv", "class_name": "DepthwiseConv2D", "config": {"name": "block3b_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["block3b_expand_activation", 0, 0, {}]]]}, {"name": "block3b_bn", "class_name": "BatchNormalization", "config": {"name": "block3b_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block3b_dwconv", 0, 0, {}]]]}, {"name": "block3b_activation", "class_name": "Activation", "config": {"name": "block3b_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block3b_bn", 0, 0, {}]]]}, {"name": "block3b_se_squeeze", "class_name": "GlobalAveragePooling2D", "config": {"name": "block3b_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block3b_activation", 0, 0, {}]]]}, {"name": "block3b_se_reshape", "class_name": "Reshape", "config": {"name": "block3b_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 240]}, "inbound_nodes": [[["block3b_se_squeeze", 0, 0, {}]]]}, {"name": "block3b_se_reduce", "class_name": "Conv2D", "config": {"name": "block3b_se_reduce", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3b_se_reshape", 0, 0, {}]]]}, {"name": "block3b_se_expand", "class_name": "Conv2D", "config": {"name": "block3b_se_expand", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3b_se_reduce", 0, 0, {}]]]}, {"name": "block3b_se_excite", "class_name": "Multiply", "config": {"name": "block3b_se_excite", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block3b_activation", 0, 0, {}], ["block3b_se_expand", 0, 0, {}]]]}, {"name": "block3b_project_conv", "class_name": "Conv2D", "config": {"name": "block3b_project_conv", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3b_se_excite", 0, 0, {}]]]}, {"name": "block3b_project_bn", "class_name": "BatchNormalization", "config": {"name": "block3b_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block3b_project_conv", 0, 0, {}]]]}, {"name": "block3b_drop", "class_name": "FixedDropout", "config": {"name": "block3b_drop", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": [null, 1, 1, 1], "seed": null}, "inbound_nodes": [[["block3b_project_bn", 0, 0, {}]]]}, {"name": "block3b_add", "class_name": "Add", "config": {"name": "block3b_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block3b_drop", 0, 0, {}], ["block3a_project_bn", 0, 0, {}]]]}, {"name": "block4a_expand_conv", "class_name": "Conv2D", "config": {"name": "block4a_expand_conv", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3b_add", 0, 0, {}]]]}, {"name": "block4a_expand_bn", "class_name": "BatchNormalization", "config": {"name": "block4a_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block4a_expand_conv", 0, 0, {}]]]}, {"name": "block4a_expand_activation", "class_name": "Activation", "config": {"name": "block4a_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block4a_expand_bn", 0, 0, {}]]]}, {"name": "block4a_dwconv", "class_name": "DepthwiseConv2D", "config": {"name": "block4a_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["block4a_expand_activation", 0, 0, {}]]]}, {"name": "block4a_bn", "class_name": "BatchNormalization", "config": {"name": "block4a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block4a_dwconv", 0, 0, {}]]]}, {"name": "block4a_activation", "class_name": "Activation", "config": {"name": "block4a_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block4a_bn", 0, 0, {}]]]}, {"name": "block4a_se_squeeze", "class_name": "GlobalAveragePooling2D", "config": {"name": "block4a_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block4a_activation", 0, 0, {}]]]}, {"name": "block4a_se_reshape", "class_name": "Reshape", "config": {"name": "block4a_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 240]}, "inbound_nodes": [[["block4a_se_squeeze", 0, 0, {}]]]}, {"name": "block4a_se_reduce", "class_name": "Conv2D", "config": {"name": "block4a_se_reduce", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block4a_se_reshape", 0, 0, {}]]]}, {"name": "block4a_se_expand", "class_name": "Conv2D", "config": {"name": "block4a_se_expand", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block4a_se_reduce", 0, 0, {}]]]}, {"name": "block4a_se_excite", "class_name": "Multiply", "config": {"name": "block4a_se_excite", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block4a_activation", 0, 0, {}], ["block4a_se_expand", 0, 0, {}]]]}, {"name": "block4a_project_conv", "class_name": "Conv2D", "config": {"name": "block4a_project_conv", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block4a_se_excite", 0, 0, {}]]]}, {"name": "block4a_project_bn", "class_name": "BatchNormalization", "config": {"name": "block4a_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block4a_project_conv", 0, 0, {}]]]}, {"name": "block4b_expand_conv", "class_name": "Conv2D", "config": {"name": "block4b_expand_conv", "trainable": true, "dtype": "float32", "filters": 480, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block4a_project_bn", 0, 0, {}]]]}, {"name": "block4b_expand_bn", "class_name": "BatchNormalization", "config": {"name": "block4b_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block4b_expand_conv", 0, 0, {}]]]}, {"name": "block4b_expand_activation", "class_name": "Activation", "config": {"name": "block4b_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block4b_expand_bn", 0, 0, {}]]]}, {"name": "block4b_dwconv", "class_name": "DepthwiseConv2D", "config": {"name": "block4b_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["block4b_expand_activation", 0, 0, {}]]]}, {"name": "block4b_bn", "class_name": "BatchNormalization", "config": {"name": "block4b_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["block4b_dwconv", 0, 0, {}]]]}, {"name": "block4b_activation", "class_name": "Activation", "config": {"name": "block4b_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "inbound_nodes": [[["block4b_bn", 0, 0, {}]]]}, {"name": "block4b_se_squeeze", "class_name": "GlobalAveragePooling2D", "config": {"name": "block4b_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block4b_activation", 0, 0, {}]]]}, {"name": "block4b_se_reshape", "class_name": "Reshape", "config": {"name": "block4b_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 480]}, "inbound_nodes": [[["block4b_se_squeeze", 0, 0, {}]]]}, {"name": "block4b_se_reduce", "class_name": "Conv2D", "config": {"name": "block4b_se_reduce", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block4b_se_reshape", 0, 0, {}]]]}, {"name": "block4b_se_expand", "class_name": "Conv2D", "config": {"name": "block4b_se_expand", "trainable": true, "dtype": "float32", "filters": 480, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block4b_se_reduce", 0, 0, {}]]]}, {"name": "block4b_se_excite", "class_name": "Multiply", "config": {"name": "block4b_se_excite", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block4b_activation", 0, 0, {}], ["block4b_se_expand", 0, 0, {}]]]}, {"name": "block4b_project_conv", "class_name": "Conv2D", "config": {"name": "block4b_project_conv", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block4b_se_excite", 0, 0, {}]]]}, {"name": "block4b_project_bn", "class_name": "BatchNormalization", "config": {"name": "block4b_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, 